### Como leemos librerias en Python

import nombre_de_la_librerias as alias

In [1]:
import pandas as pd
import numpy as np
import datetime

para leer un dataframe desde un archivo CSV podemos usar el metodo read_csv de la libreria de pandas, mandando como parametro el nombre del archivo y en ocuaciones el delimitador

In [19]:
df = pd.read_csv("example_data.csv", delimiter=";")

Para imprimir el dataframe asigado a la variable de df en pandas lo podemos hacer llamando la variable pura

Como podemos acceder al diccionario de un dataframe

In [16]:
df.to_dict()['time'][1]

'2018-10-13 04:34:15.580'

Ejemplo de como construimos nuestro diccionario

In [18]:
o1 = { 
    "name": "Uayeb"
    , "lastname": "Caballero"
}

In [20]:
o1["lastname"]

'Caballero'

In [22]:
a = {
    "id": [1,2,4,5,6,7]
    , "name": ["Luis","Jose","Elminson","Rony","Rovin","Jesus"]
}

In [24]:
pd.DataFrame(a)

   id      name
0   1      Luis
1   2      Jose
2   4  Elminson
3   5      Rony
4   6     Rovin
5   7     Jesus

In [33]:
df_read_by_dict = pd.DataFrame({
    "id": [1,2,4,5,6,7]
    , "name": ["Luis","Jose","Elminson","Rony","Rovin","Jesus"]
    , "year_study" : [3,3,3,4,3,5]
})

select 
    year_study
    , count(id) as frequencia 
from df_read_by_dict
group by year_study

In [35]:
df_read_by_dict["name"]

0        Luis
1        Jose
2    Elminson
3        Rony
4       Rovin
5       Jesus
Name: name, dtype: object

In [36]:
df_read_by_dict.dtypes

id             int64
name          object
year_study     int64
dtype: object

## creacion de dataframes usando diccionarios y manipulacion de ellos

In [1]:
asignaciones = {
    'Inteligencia_Artificila': [1,0,2,4,1]
    , 'Gerencia': [3,1,3,2,0]
    , 'Arquitectura': [7,0,3,1,1]
    , 'Industria': [1,1,1,1,1]    
}

In [6]:
pd.DataFrame( asignaciones ).columns

Index(['Inteligencia_Artificila', 'Gerencia', 'Arquitectura', 'Industria'], dtype='object')

In [7]:
pd.DataFrame( asignaciones ).index

RangeIndex(start=0, stop=5, step=1)

In [23]:
df = pd.DataFrame( asignaciones , index = ['lunes','martes','miercoles','jueves','viernes'] )

## Selecciones

In [31]:
df

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
martes                           0         1             0          1
miercoles                        2         3             3          1
jueves                           4         2             1          1
viernes                          1         0             1          1

In [52]:
df > 1

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                        False      True          True      False
martes                       False     False         False      False
miercoles                     True      True          True      False
jueves                        True      True         False      False
viernes                      False     False         False      False

inicia_en:terminamos_en-1

In [36]:
df.iloc[ 0 , 0:3 ]

Inteligencia_Artificila    1
Gerencia                   3
Arquitectura               7
Name: lunes, dtype: int64

In [46]:
df.iloc[ 1:3 , 0:4 ]

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
martes                           0         1             0          1
miercoles                        2         3             3          1

In [47]:
df.iloc[ [0,2,4] , 0:4 ]

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
miercoles                        2         3             3          1
viernes                          1         0             1          1

In [50]:
df['Gerencia'].values > 1

array([ True, False,  True,  True, False])

In [53]:
df.iloc[ [ True, False,  True,  True, False] , 0:4 ]

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
miercoles                        2         3             3          1
jueves                           4         2             1          1

In [63]:
df_filtered = df.iloc[ (df['Gerencia'].values > 1) & (df['Arquitectura'].values > 1) , 1:3 ]

In [68]:
df.iloc[ : , 1:3 ]

           Gerencia  Arquitectura
lunes             3             7
martes            1             0
miercoles         3             3
jueves            2             1
viernes           0             1

In [69]:
~( (df['Gerencia'].values > 1) & (df['Arquitectura'].values > 1) )

array([False,  True, False,  True,  True])

In [65]:
df_filtered.iloc[0,0] = 1

In [66]:
df_filtered

           Gerencia  Arquitectura
lunes             1             7
miercoles         3             3

In [67]:
df

           Inteligencia_Artificila  Gerencia  Arquitectura  Industria
lunes                            1         3             7          1
martes                           0         1             0          1
miercoles                        2         3             3          1
jueves                           4         2             1          1
viernes                          1         0             1          1

## uso de loc

loc de la misma que iloc nos ayuda hacer subset de nuestros dataframes, la diferencia de este es que podemos hacer uso de los nombres de las columnas a diferencia de iloc, como nombre lo indica *i = index*

In [2]:
dataframe_size = 100

In [3]:
np.random.seed(111)

In [63]:
x = pd.DataFrame(
    {
        'id' : [ np.random.randint(20) for x in range(dataframe_size) ]
        , 'fecha' : [ np.random.choice( pd.date_range( end = datetime.date( 2022 , 2 , 24 ) , freq='1W' , periods=10  )) for x in range(100) ]
        , 'notas': np.random.rand(dataframe_size)
        , 'scholarship': [ np.random.choice([True,False]) for x in range(dataframe_size) ]
    }
)

In [64]:
[ np.random.choice([True,False]) for x in range(5) ]

[True, True, False, False, True]

In [65]:
[ np.random.randint(1000) for x in range(5) ]

[63, 935, 861, 637, 412]

In [66]:
pd.date_range( end = datetime.date( 2022 , 2 , 24 ) , freq='1W' , periods=10  )

DatetimeIndex(['2021-12-19', '2021-12-26', '2022-01-02', '2022-01-09',
               '2022-01-16', '2022-01-23', '2022-01-30', '2022-02-06',
               '2022-02-13', '2022-02-20'],
              dtype='datetime64[ns]', freq='W-SUN')

In [67]:
y = x.loc[ ( x['notas'] < 0.4) & ( x['scholarship'] )  , ['id','fecha']   ]

In [68]:
y.shape[0] / x.shape[0]

0.18

In [69]:
x.loc[ : , ['fecha'] ].drop_duplicates().shape

(10, 1)

In [70]:
x.loc[ :, ["id","fecha"] ].groupby( ["id"] , as_index = False ).count()

    id  fecha
0    0      5
1    1      7
2    2      7
3    3      5
4    5      5
5    6      4
6    7      3
7    8      3
8    9      5
9   10     14
10  11      3
11  12      7
12  13      3
13  14      2
14  15      7
15  16      4
16  17      6
17  18      4
18  19      6

In [71]:
x.loc[ :, ["id","fecha"] ].groupby( ["id"] , as_index = False ).count().columns

Index(['id', 'fecha'], dtype='object')

In [72]:
xx = x.groupby( ["id"] , as_index=False ).agg( { "fecha" : ["count"] , "notas": ["max","min"]  } )

Select 
    id
    , count(fechas) as conteo_de_eventos
    , max(notas) as max_nota
    , min(notas) as min_notas
from x
group by id

In [73]:
xx.columns = xx.columns.droplevel(1)

In [74]:
problemas_scholarship = x.groupby( ["id","scholarship"], as_index = False ).agg( { "fecha":["count"] } )

In [75]:
problemas_scholarship.columns = problemas_scholarship.columns.droplevel(1)

In [76]:
problemas_scholarship = problemas_scholarship.loc[:,["id","scholarship"]].groupby( ["id"] ,as_index = False ).count()

In [77]:
problemas_scholarship.loc[ problemas_scholarship['scholarship'] == 2 , : ]

    id  scholarship
0    0            2
1    1            2
2    2            2
3    3            2
4    5            2
5    6            2
6    7            2
8    9            2
9   10            2
10  11            2
11  12            2
12  13            2
13  14            2
14  15            2
16  17            2
17  18            2
18  19            2

In [78]:
problemas_scholarship.loc[ problemas_scholarship['scholarship'] == 2 , : ].shape[0] / x.loc[ :  , ["id"] ].drop_duplicates().shape[0]

0.8947368421052632

In [79]:
x

    id      fecha     notas  scholarship
0   15 2021-12-19  0.300647         True
1    1 2021-12-26  0.639742         True
2    0 2022-02-06  0.541736         True
3   19 2022-01-16  0.469805        False
4   19 2022-02-13  0.528066         True
..  ..        ...       ...          ...
95  10 2022-02-13  0.778544        False
96   2 2021-12-19  0.544383         True
97  12 2022-01-30  0.412388         True
98   6 2022-01-02  0.858050        False
99   2 2022-02-20  0.021905         True

[100 rows x 4 columns]

In [80]:
x.loc[ x["id"] == 9 , : ].sort_values(["fecha"])

    id      fecha     notas  scholarship
6    9 2021-12-19  0.387580        False
45   9 2022-01-02  0.476649        False
85   9 2022-01-23  0.805705         True
44   9 2022-02-06  0.123305         True
52   9 2022-02-13  0.746340         True

In [81]:
x.sort_values(["id","fecha"]).groupby(["id"])["fecha"].rank( method = 'first' , ascending = True )

22    1.0
9     2.0
2     3.0
15    4.0
24    5.0
     ...
12    2.0
94    3.0
53    4.0
4     5.0
23    6.0
Name: fecha, Length: 100, dtype: float64

In [82]:
x = x.sort_values(["id","fecha"] , ascending = False )

In [83]:
x["rank"] = x.groupby(["id"])["fecha"].rank( method = 'first' , ascending = False )

In [84]:
real_scholarships = x.loc[ x['rank'] == 1 , ["id","scholarship"] ]

In [85]:
real_scholarships.columns = ['id','last_scholarship']

In [86]:
x

    id      fecha     notas  scholarship  rank
23  19 2022-02-20  0.404220        False   1.0
4   19 2022-02-13  0.528066         True   2.0
53  19 2022-02-06  0.294623         True   3.0
94  19 2022-01-30  0.475014         True   4.0
12  19 2022-01-23  0.449896        False   5.0
..  ..        ...       ...          ...   ...
24   0 2022-02-20  0.179034         True   1.0
15   0 2022-02-13  0.511180        False   2.0
2    0 2022-02-06  0.541736         True   3.0
9    0 2022-01-02  0.606585        False   4.0
22   0 2021-12-26  0.248450        False   5.0

[100 rows x 5 columns]

In [87]:
real_scholarships

    id  last_scholarship
23  19             False
61  18              True
50  17             False
41  16              True
51  15             False
80  14              True
11  13             False
7   12              True
69  11             False
70  10              True
52   9              True
32   8             False
57   7             False
81   6              True
63   5              True
65   3             False
99   2              True
37   1             False
24   0              True

In [88]:
x = x.merge( real_scholarships , left_on=["id"] , right_on=["id"] , how="inner" )

In [92]:
x = x.drop( ['rank','scholarship'] , axis=1 )

KeyError: "['rank' 'scholarship'] not found in axis"

In [62]:
x

    id      fecha     notas  last_scholarship_x  last_scholarship_y
0   19 2022-01-30  0.868261               False               False
1   19 2022-01-02  0.781551               False               False
2   19 2021-12-19  0.901838               False               False
3   18 2022-02-20  0.889866                True                True
4   18 2022-02-13  0.589285                True                True
..  ..        ...       ...                 ...                 ...
95   0 2022-02-06  0.433068                True                True
96   0 2022-01-09  0.580126                True                True
97   0 2022-01-02  0.747628                True                True
98   0 2021-12-26  0.388195                True                True
99   0 2021-12-19  0.460593                True                True

[100 rows x 5 columns]